/*********** Урок 3 ************/

public class Strings {
    public static void main(String[] args) {

        /*
         Тип String относится к ссылочному типу данных. В отличие от примитивных типов, которые записываются
         с маленькой буквы (int, boolean и т.д.), ссылочные типы начинаются с заглавной буквы,
         так как они являются классами.
        */


        // Объединение строк
        String word = "Hello";
        String name = "Vasya";
        String greeting = word + " " + name;

        // Объединение строк с примитивными типами данных
        int x = 23;
        System.out.println("My number is " + x);


        /*
         -----Особенности ссылочных типов данных-----
          Ссылочные типы данных хранят ссылку на объект.
        */

    }
}
