/*********** Урок 2 ************/

public class Variables {
    public static void main(String[] args) {
        int myInt; // Объявив переменную мы выделили для нее память в ОЗУ
        myInt = 1; // Инициализируем переменную

        // Примитивные типы данных
        int intVar = 357; // Занимает 32 бита.
        short shortVar = 3233; // Занимает 16 бита.
        long longVar = 2131232131; // Занимает 64 бита.
        float floatVar = 2341.4f; // Занимает 32 бита.
        double doubleVar = 213.45; // Занимает 64 бита.
        char charVar = 'A'; // Занимает 16 бит и описывает символ.
        boolean booleanVar = true;  // Может хранить либо true или False
        byte byteVar = 123; // Занимает 8 бит (1 байт) н используется для представления целых чисел в диапазоне от -128 до 127

        /*
         -----Особенности примитивных типов данных-----
         Примитивные типы у себя внутри хранят значение
        */
    }
}
